<div>
<div style="float:left"><img src="sibeite.jpg"></img></div>

1。整个页面没有提交按钮，也没有相关脚本
第一个问题是HTML的基本常识呀，image元素的默认动作就是submit嘛

2。加入附件之后页面上能显示出该文件的大小，可是页面并没有刷新，
要是asp的话，要用RS吧，就算其他东东客户端也要有相应脚本吧。
可是View Source竟没有一句<script>!!迷惑！
答：第二个问题你描述不正确，其实它是先提交到服务器上处理后，才知道
文件有多大的，至于你说的什么没有刷新，可能是由于你上传的文件小，
速度很快，而且本来那一页就没为空就可以
知道是点击的哪个submit了。。。
一种偷懒的办法哦。。。

4。请讲讲插入图片的方法吧
答：Rnd 没有初始化吧（randomize()）

2。加入附件之后页面上能显示出该文件的大小，可是页面并没有刷新，
要是asp的话，要用RS吧，就算其他东东客户端也要有相应脚本吧。
可是View Source竟没有一句<script>!!迷惑！
答：第二个问题你描述不正确，其实它是先提交到服务器上处理后，才知道
文件有多大的，至于你说的什么没有刷新，可能是由于你上传的文件小，
速度很快，而且本来那一页就没为空就可以
知道是点击的哪个submit了。。。
一种偷懒的办法哦。。。

4。请讲讲插入图片的方法吧
答：Rnd 没有初始化吧（randomize()）

</div>